<a href="https://colab.research.google.com/github/allanstar-byte/ESTRELLA/blob/master/SQL_WORLD_SUICIDE_ANALYTICS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **SQL DATA CLEANING, OUTLIERS AND ANALYTICS**

# **1. Connecting to our Database**

In [1]:
#loading the sql extension into our environment
%load_ext sql

# Then connect to our in memory sqlite database
 
%sql sqlite://

'Connected: @None'

# **2. Importing Data from CSV files**

The dataset we will use contains suicide cases from different countries in the world with different generations, age groups and other factors as outlined below.

In [2]:
# Importing the pandas library
# We will use a function read_csv from pandas to read our datasets as shown
#
import pandas as pd

In [3]:
# Loading our table from the respective CSV files 
with open('/content/Suicide.csv','r') as f:
    Suicide = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS Suicide
%sql PERSIST Suicide;
%sql SELECT * FROM Suicide LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[(0, 'Albania', 1987, 'male', '15-24 years', 21, 312900, 6.71, 2156624900.0, 796, 'Generation X', 0.006711409395973153),
 (1, 'Albania', 1987, 'male', '35-54 years', 16, 308000, 5.19, 2156624900.0, 796, 'Silent', 0.005194805194805196),
 (2, 'Albania', 1987, 'female', '15-24 years', 14, 289700, 4.83, 2156624900.0, 796, 'Generation X', 0.004832585433206766),
 (3, 'Albania', 1987, 'male', '75+ years', 1, 21800, 4.59, 2156624900.0, 796, 'G.I. Generation', 0.004587155963302753),
 (4, 'Albania', 1987, 'male', '25-34 years', 9, 274300, 3.28, 2156624900.0, 796, 'Boomers', 0.0032810791104629965)]

# **3. Analytics**

In [4]:
#1. identifying top 5 countries with the highest suicide cases in the world
%%sql
SELECT Country, 
SUM (Suicides_no) 
FROM Suicide 
GROUP BY Country
ORDER BY SUM (Suicides_no) DESC
limit 5;

 * sqlite://
Done.

[('Bulgaria', 31114),
 ('Hungary', 30122),
 ('Chile', 30111),
 ('Colombia', 28094),
 ('Romania', 27161)]

In [5]:
#2. identifying top 5 countries with the lowest suicide cases in the world
%%sql
SELECT Country, 
SUM (Suicides_no) 
FROM Suicide 
GROUP BY Country
ORDER BY SUM (Suicides_no) ASC
limit 5;

 * sqlite://
Done.

[('Dominica', 0),
 ('Saint Kitts and Nevis', 0),
 ('San Marino', 1),
 ('Antigua and Barbuda', 11),
 ('Maldives', 20)]

In [14]:
#3. identifying the generation with the highest suicide cases
%%sql
SELECT Generation, 
SUM (Suicide_rate) 
FROM Suicide 
GROUP BY Generation
ORDER BY SUM (Suicide_rate) DESC
limit 5;

 * sqlite://
Done.

[('Silent', 68.9819648605656),
 ('G.I. Generation', 48.559870123235115),
 ('Generation X', 41.461184945162145),
 ('Boomers', 36.59115653391015),
 ('Millenials', 18.740245430099733)]

In [15]:
#4. identifying the generations with the lowest suicide cases
%%sql
SELECT Generation, 
SUM (Suicide_rate) 
FROM Suicide 
GROUP BY Generation
ORDER BY SUM (Suicide_rate) ASC
limit 5;

 * sqlite://
Done.

[('Generation Z', 0.6941691244818434),
 ('Millenials', 18.740245430099733),
 ('Boomers', 36.59115653391015),
 ('Generation X', 41.461184945162145),
 ('G.I. Generation', 48.559870123235115)]

In [16]:
#5 Investigating which gender has more suicide rates compared to the other one
%%sql
SELECT Sex, 
SUM (Suicides_no) 
FROM Suicide 
GROUP BY Sex
ORDER BY SUM (Suicides_no) DESC
limit 5;

 * sqlite://
Done.

[('male', 498619), ('female', 329940)]

In [9]:
#6. Knowing the age group which most people commit suicide
%%sql
SELECT Age, 
SUM (Suicides_no) 
FROM Suicide 
GROUP BY Age
ORDER BY SUM (Suicide_rate) DESC
limit 5;

 * sqlite://
Done.

[('75+ years', 122442),
 ('55-74 years', 184481),
 ('25-34 years', 165014),
 ('35-54 years', 185622),
 ('15-24 years', 149630)]

In [17]:
#7. Finding out the year where people committed suicide the most
%%sql
SELECT Year, 
SUM (Suicides_no) 
FROM Suicide 
GROUP BY Year
ORDER BY SUM (Suicides_no) DESC
limit 5;

 * sqlite://
Done.

[(1999, 35636), (2000, 35279), (2002, 35128), (2001, 34769), (1997, 34544)]

In [11]:
#8. Finding which countries has the most suicides comited at every 100,000
%%sql
SELECT Country, 
SUM (Suicides_per_hundred_thousand_pop) 
FROM Suicide 
GROUP BY Country
ORDER BY SUM (Suicides_per_hundred_thousand_pop) DESC
limit 5;

 * sqlite://
Done.

[('Lithuania', 8091.179999999998),
 ('Latvia', 7264.590000000004),
 ('Suriname', 7162.319999999997),
 ('Slovenia', 7012.619999999997),
 ('Estonia', 6873.780000000001)]

In [18]:
#9. Finding which countries has the leas suicides comited at every 100,000
%%sql
SELECT Country, 
SUM (Suicides_per_hundred_thousand_pop) 
FROM Suicide 
GROUP BY Country
ORDER BY SUM (Suicides_per_hundred_thousand_pop) ASC
limit 7;

 * sqlite://
Done.

[('Dominica', 0.0),
 ('Saint Kitts and Nevis', 0.0),
 ('Russian Federation', 10.52),
 ('Oman', 26.5),
 ('Qatar', 27.300000000000004),
 ('San Marino', 47.26),
 ('United Arab Emirates', 50.489999999999995)]

In [13]:
#10. Finding which Age groups has the most suicides commited at every 100,000
%%sql
SELECT Age, 
SUM (Suicides_per_hundred_thousand_pop) 
FROM Suicide 
GROUP BY Age
ORDER BY SUM (Suicides_per_hundred_thousand_pop) DESC
limit 5;

 * sqlite://
Done.

[('75+ years', 77855.35000000012),
 ('55-74 years', 40175.260000000024),
 ('25-34 years', 35094.57000000001),
 ('35-54 years', 32224.650000000027),
 ('15-24 years', 27357.850000000042)]